{
  "version": 1,
  "styles": [
    {
      "id": "grade_teal_and_orange",
      "name": "Color Grade: Teal and Orange",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, cinematic color grade, teal and orange, rich contrast",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: teal shadows and warm highlights, cinematic contrast. Tone mapping: smooth highlights and coherent shadows. Key cues: cinematic color grade, teal and orange, rich contrast. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_muted_pastels",
      "name": "Color Grade: Muted Pastels",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, muted pastel palette, soft contrast, gentle highlights",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color palette: muted pastels with soft contrast. Tone mapping: smooth highlights and coherent shadows. Key cues: muted pastel palette, soft contrast, gentle highlights. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_high_contrast_monochrome",
      "name": "Color Grade: High Contrast Monochrome",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, black and white, high contrast, deep blacks",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: monochrome with deep blacks and bright whites. Tone mapping: smooth highlights and coherent shadows. Key cues: black and white, high contrast, deep blacks. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_warm_vintage",
      "name": "Color Grade: Warm Vintage",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, warm vintage grade, slightly faded, soft highlights",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: warm vintage tones with gentle fade. Tone mapping: smooth highlights and coherent shadows. Key cues: warm vintage grade, slightly faded, soft highlights. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_cool_desaturated",
      "name": "Color Grade: Cool Desaturated",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, cool tones, desaturated palette, clean contrast",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color palette: cool and slightly desaturated. Tone mapping: smooth highlights and coherent shadows. Key cues: cool tones, desaturated palette, clean contrast. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_bleach_bypass_look",
      "name": "Color Grade: Bleach Bypass Look",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, bleach bypass look, desaturated, high contrast",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: desaturated high-contrast bleach-bypass look. Tone mapping: smooth highlights and coherent shadows. Key cues: bleach bypass look, desaturated, high contrast. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_soft_cinematic_pastel",
      "name": "Color Grade: Soft Cinematic Pastel",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, soft cinematic, pastel grade, subtle bloom",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: soft cinematic pastel with gentle bloom. Tone mapping: smooth highlights and coherent shadows. Key cues: soft cinematic, pastel grade, subtle bloom. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_vibrant_pop",
      "name": "Color Grade: Vibrant Pop",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, vibrant colors, punchy saturation, crisp contrast",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: vibrant, punchy saturation with crisp contrast. Tone mapping: smooth highlights and coherent shadows. Key cues: vibrant colors, punchy saturation, crisp contrast. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_earthy_documentary",
      "name": "Color Grade: Earthy Documentary",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, earthy tones, natural contrast, subtle grain",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color palette: earthy documentary tones, natural contrast. Tone mapping: smooth highlights and coherent shadows. Key cues: earthy tones, natural contrast, subtle grain. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_neon_night_grade",
      "name": "Color Grade: Neon Night Grade",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, neon grade, deep shadows, bright neon",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: deep shadows with bright neon highlights. Tone mapping: smooth highlights and coherent shadows. Key cues: neon grade, deep shadows, bright neon. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_golden_hour_warmth",
      "name": "Color Grade: Golden Hour Warmth",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, golden hour grade, warm highlights, soft shadows",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: golden-hour warmth with soft shadow rolloff. Tone mapping: smooth highlights and coherent shadows. Key cues: golden hour grade, warm highlights, soft shadows. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_cold_winter_blues",
      "name": "Color Grade: Cold Winter Blues",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, cold winter grade, blue shadows, crisp air",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color palette: cold winter blues with crisp contrast. Tone mapping: smooth highlights and coherent shadows. Key cues: cold winter grade, blue shadows, crisp air. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_sepia_tone",
      "name": "Color Grade: Sepia Tone",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, sepia tone, vintage print, soft contrast",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: sepia tone with vintage print feel. Tone mapping: smooth highlights and coherent shadows. Key cues: sepia tone, vintage print, soft contrast. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_film_grain_matte",
      "name": "Color Grade: Film Grain Matte",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, matte grade, lifted blacks, film grain",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: matte look with lifted blacks and fine grain. Tone mapping: smooth highlights and coherent shadows. Key cues: matte grade, lifted blacks, film grain. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_clean_commercial",
      "name": "Color Grade: Clean Commercial",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, clean commercial grade, neutral whites, natural color",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: clean commercial neutrality with accurate whites. Tone mapping: smooth highlights and coherent shadows. Key cues: clean commercial grade, neutral whites, natural color. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_moody_low_saturation",
      "name": "Color Grade: Moody Low Saturation",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, moody, low saturation, deep shadows",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color palette: low saturation with deep shadows and moody contrast. Tone mapping: smooth highlights and coherent shadows. Key cues: moody, low saturation, deep shadows. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_bright_airy",
      "name": "Color Grade: Bright Airy",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, bright airy, high key, soft highlights",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: bright airy look with soft highlights. Tone mapping: smooth highlights and coherent shadows. Key cues: bright airy, high key, soft highlights. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_vintage_slide_look",
      "name": "Color Grade: Vintage Slide Look",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, vintage slide look, rich reds, crisp contrast",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: rich reds and crisp contrast, vintage slide feel. Tone mapping: smooth highlights and coherent shadows. Key cues: vintage slide look, rich reds, crisp contrast. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_cyanotype_look",
      "name": "Color Grade: Cyanotype Look",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, cyanotype look, blue monochrome, paper texture",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: blue monochrome cyanotype print feel. Tone mapping: smooth highlights and coherent shadows. Key cues: cyanotype look, blue monochrome, paper texture. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    },
    {
      "id": "grade_duotone_blue_red",
      "name": "Color Grade: Duotone Blue/Red",
      "category": "Color Grade",
      "default": {
        "prefix": "intentional color grade, filmic tone mapping, duotone, blue and red, graphic contrast",
        "suffix": "clean tones, smooth highlight rolloff, clean shadows, color separation, balanced contrast"
      },
      "models": {
        "flux_2_klein": {
          "prefix": "",
          "suffix": "Style: realistic image with an intentional color grade. Color grade: duotone blue and red with graphic contrast. Tone mapping: smooth highlights and coherent shadows. Key cues: duotone, blue and red, graphic contrast. Finish cues: clean tones. Instruction: preserve the user prompt subject and add only stylistic cues."
        }
      },
      "tags": [
        "grade",
        "color"
      ]
    }
  ]
}
